Revit 2024 API
Ceramic Class
 A static class that provides access to the property names that appear in the Ceramic visual asset schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static class Ceramic
Visual Basic
Public NotInheritable Class Ceramic
Visual C++
public ref class Ceramic abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Ceramic
See Also
Ceramic Members
Autodesk.Revit.DB.Visual Namespace